import pandas as pd
import pytest


@pytest.fixture
def sample_transactions():
    return pd.DataFrame(
        {
            "Дата операции": [
                "01.01.2022 12:00:00",
                "02.01.2022 12:00:00",
                "03.01.2022 12:00:00",
            ],
            "Категория": ["Category1", "Category1", "Category2"],
            "Сумма операции": [-100, -200, -300],
            "Описание": ["Desc1", "Desc2", "Desc3"],
            "Кэшбэк": [0.0, 20.0, 30.0],
        }
    )


@pytest.fixture
def sample_dict():
    return [
        {
            "Дата операции": "01.01.2022 12:00:00",
            "Категория": "Category1",
            "Сумма операции": -100,
            "Описание": "Desc1",
            "Кэшбэк": 0.0,
        },
        {
            "Дата операции": "02.01.2022 12:00:00",
            "Категория": "Category1",
            "Сумма операции": -200,
            "Описание": "Desc2",
            "Кэшбэк": 20.0,
        },
        {
            "Дата операции": "03.01.2022 12:00:00",
            "Категория": "Category2",
            "Сумма операции": -300,
            "Описание": "Desc3",
            "Кэшбэк": 30.0,
        },
    ]


@pytest.fixture
def sample_dict_no_cashback():
    return [
        {
            "Дата операции": "01.01.2022 12:00:00",
            "Категория": "Category1",
            "Сумма операции": -100,
            "Описание": "Desc1",
            "Кэшбэк": 0.0,
        },
        {
            "Дата операции": "02.01.2022 12:00:00",
            "Категория": "Category1",
            "Сумма операции": -200,
            "Описание": "Desc2",
            "Кэшбэк": 0.0,
        },
        {
            "Дата операции": "03.01.2022 12:00:00",
            "Категория": "Category2",
            "Сумма операции": -300,
            "Описание": "Desc3",
            "Кэшбэк": 0.0,
        },
    ]
